fun main() {
    println("целочисленные - ")
    println("Byte: хранит целое число от -128 до 127 и занимает 1 байт")
    println("Short: хранит целое число от -32 768 до 32 767 и занимает 2 байта")
    println("Int: хранит целое число от -2 147 483 648 (-231) \nдо 2 147 483 647 (231 - 1) и занимает 4 байта")
    println("Long: хранит целое число от –9 223 372 036 854 775 808 (-263)\nдо 9 223 372 036 854 775 807 (263-1) и занимает 8 байт")
    println("Строки представлены типом String. Строка представляет последовательность символов,\nзаключенную в двойные кавычки, либо в тройные двойные кавычки.")
}